<a href="https://colab.research.google.com/github/HKyeol/Python_study/blob/master/201207%EC%9E%90%EB%A3%8C%ED%98%95%2C%EA%B2%B0%EC%B8%A1%EC%B9%98%2C%ED%8C%8C%EC%83%9D%EB%B3%80%EC%88%98.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 복습

1. 파이썬의 자료형 5가지
2. 파이썬 연산자
3. if문
4. loop문
5. 문자열에서 특정 위치의 철자 검색, 슬라이싱 검색
6. 파이썬으로 함수 생성
7. 파이썬으로 클래스 생성
8. 파이썬의 예외처리
9. 판다스 사용법

면접문제  
클래스를 왜 사용해야 하는지? (객체지향 언어의 장점이 무엇인지?)  
답: 상속을 사용할 수 있기 때문입니다.  

상속을 사용했을 때 어떤 장점이 있습니까?  
답: 부모 클래스가 작성한 기능(메소드)을 코딩하지 않아도됩니다. 중요한 기능은 부모 클래스를 작성하는 팀장님이 구현하고 팀원인 나는 팀장님이 구현한 중요 기능을 그대로 상속받고 팀장님이 시키신 상세코드에 집중하면 됩니다.  

* 판다스로 조인하기 복습  

판다스로 조인(join)을 하기 위해서는 merge를 사용하면 됩니다.  

```
문법:
pandas.merge(emp_left,dept_right,how = 'inner', on = 'deptno')

옵션:
     how = 'inner' : 디폴트 값이다. emp와 dept 데이터 프레임에 공통적으로 존재하는 교집합일 경우에만 추출
     how = 'outer' : 열의 데이터가 양쪽 데이터 프레임에 공통적으로 존재하는 교집합이 아니어도 추출하겠다.
     how = 'left' : 왼쪽 데이터 프레임의 키열에 속하는 데이터값을 기준으로 병합하겠다.
     how = 'right' : 오른쪽 데이터 프레임의 키열에 속하는 데이터값을 기준으로 병합하겠다.
```

In [ ]:
import pandas as pd
#from google.colab import files
#myfile = files.upload()
emp = pd.read_csv('emp3.csv')
dept = pd.read_csv('dept3.csv')
result = pd.merge(emp, dept, on = 'deptno', how = 'left')
print(result[['ename','loc']])

     ename       loc
0     KING  NEW YORK
1    BLAKE   CHICAGO
2    CLARK  NEW YORK
3    JONES    DALLAS
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9     FORD    DALLAS
10   SMITH    DALLAS
11   SCOTT    DALLAS
12   ADAMS    DALLAS
13  MILLER  NEW YORK

```
select e.ename, d.loc
    from emp e, dept d
    where e.deptno = d.deptno(+)
```
와 같다.  

문제221. 부서번호, 부서번호별 평균월급을 출력하시오!
```
select deptno, avg(sal)
    from emp
    group by deptno;
```

In [ ]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
dept = pd.read_csv('dept3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index()
print(result)

   deptno          sal
0      10  2916.666667
1      20  2175.000000
2      30  1566.666667

아 어렵다. reset_index까지 외워야 한다.  

설명: groupby부터 시작해서 reset_index()까지가 한 세트이므로 항상 같이 써야한다.  

문제222. 위의 결과에서 평균월급을 출력할 때 정수부분만 출력하고 싶다면(소수점 이전만 출력)

In [ ]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
dept = pd.read_csv('dept3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index().astype(int)
print(result)

   deptno   sal
0      10  2916
1      20  2175
2      30  1566

astype(int)를 붙여서 정수형으로 만들어줬다.  
설명: astype(int)는 출력되는 데이터에서 정수부분만 취하라는 뜻입니다. float를 쓰면 실수로 나옴. 그런데 모든 것을 int로 바꾸는 거라서 앞부분이 deptno처럼 숫자가 아니라 str이면 에러가 난다.  

문제223. 직업과 직업별 토탈월급을 출력하시오.
```
SQL>
select job, sum(sal)
    from emp
    group by job;
```

In [ ]:
result = emp.groupby('job')['sal'].sum().reset_index()
print(result)

         job   sal
0    ANALYST  6000
1      CLERK  4150
2    MANAGER  8275
3  PRESIDENT  5000
4   SALESMAN  5600

문제224. 부서위치, 부서위치별 토탈월급을 출력하시오!  
```
SQL>
select d.loc, sum(e.sal)
    from emp e, dept d
    where e.deptno = d.deptno
    group by d.loc;
```

In [ ]:
result = pd.merge(emp, dept,on = 'deptno')
result = result.groupby('loc')['sal'].sum().reset_index()
print(result)

        loc    sal
0   CHICAGO   9400
1    DALLAS  10875
2  NEW YORK   8750

문제225. 아래의 SQL을 판다스로 구현하시오.
```
select d.loc, nvl(sum(e.sal),0)
    from emp e, dept d
    where e.deptno(+) = d.deptno #보스턴도 나오게 만듦
    group by d.loc;
```

In [ ]:
result = pd.merge(emp,dept,how='right',on='deptno')
result = result.groupby('loc')['sal'].sum().reset_index()
print(result)

        loc      sal
0    BOSTON      0.0
1   CHICAGO   9400.0
2    DALLAS  10875.0
3  NEW YORK   8750.0

문제226. 아래의 SQL을 판다스로 구현하시오!
```
SQL>
select deptno, count(*)
    from emp
    group by deptno;
```

In [ ]:
result = emp.groupby('deptno')['empno'].count().reset_index()
print(result)

   deptno  empno
0      10      3
1      20      5
2      30      6

판다스에서는 *이 없기 때문에 null값이 없는 사원번호로 대체하면 된다.  

문제227. emp122.csv를 내려받아 판다스 데이터 프레임으로 만들고 출력하시오!

In [ ]:
#myfile = files.upload()
emp12 = pd.read_csv('emp122.csv')
emp12

문제228. 통신사, 통신사별 인원수를 출력하시오.

In [ ]:
result = emp12.groupby('TELECOM')['INDEX'].count().reset_index()
print(result)

  TELECOM  INDEX
0      kt     15
1      lg      4
2      sk     11

문제229. 우리반 테이블에서 통신사가 kt이고 나이가 30살 이상인 학생들의 이름과 나이와 통신사를 출력하시오!

In [ ]:
result = emp12[['ENAME','AGE','TELECOM']][(emp12['AGE']>=30) & (emp12['TELECOM']=='kt')]
print(result)

  ENAME  AGE TELECOM
1    한결   31      kt

설명: and는 판다스에서 & 이고 or는 판다스에서 | 입니다.  
그리고 &, | 를 사용할 때는 양쪽 조건에 소괄호를 둘러줘야 합니다.

# 68. 반올림수 구하기(round)

파이썬 내장함수round()는 인자로 입력된 숫자형 자리수에서 반올림한 결과를 리턴합니다.  
예제:

In [ ]:
print(round(16.554) )    # 소수점 첫번째 자리에서 반올림
print(round(16.554, 0) ) # 소수점 첫번째 자리에서 반올림
print(round(16.554, 1) ) # 소수점 두번째 자리에서 반올림
print(round(16.554, 2) ) # 소수점 세번째 자리에서 반올림

17
17.0
16.6
16.55

* 파이썬에서 반올림할 때 중요하게 알아야 할 내용

In [ ]:
print(round(142.5)) # 143이 나와야 하는데 142가 나온다.

142

R과 파이썬은 짝수를 좋아합니다.  
```
142.5 ----------> 142  2 <- 2.5    3
187.5 ----------> 188  7    7.5 -> 8
짝수를 좋아하기 때문에 가까운 짝수를 선택한다.
```

In [ ]:
print(round(187.5)) # 188이 나온다.

188

파이썬은 기본적으로 이것을 해결하는 함수가 없습니다.  
0.5 일때는 짝수를 좋아하게끔 반올림도고 0.51 일때는 반올림됩니다. (뭐 이런 얼탱이 없는 경우가)  

예제. 판다스를 이용하지 않고 파이썬으로만 emp3.csv에서 이름과 월급을 출력하시오.

In [ ]:
import csv
#myfile = files.upload() 
file = open('emp2.csv')    # os에 있는 emp2.csv를 읽어서 file이라는 변수에 넣는다.
emp_csv = csv.reader(file) # file 변수에 있는 csv 파일을 읽어서 emp_csv 변수에 넣는다.
print(emp_csv)             # 이 상태에서 그냥 프린트하면 메모리가 주소만 나옵니다.

for emp_list in emp_csv:   # csv 파일의 내용을 한 행씩 리스트에 담아서
    print(emp_list)        # 출력합니다.

<_csv.reader object at 0x7f899d35c4a8>
['', 'empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno']
['0', '7839', 'KING', 'PRESIDENT', '', '1981-11-17', '5000', '', '10']
['1', '7698', 'BLAKE', 'MANAGER', '7839.0', '1981-05-01', '2850', '', '30']
['2', '7782', 'CLARK', 'MANAGER', '7839.0', '1981-05-09', '2450', '', '10']
['3', '7566', 'JONES', 'MANAGER', '7839.0', '1981-04-01', '2975', '', '20']
['4', '7654', 'MARTIN', 'SALESMAN', '7698.0', '1981-09-10', '1250', '1400.0', '30']
['5', '7499', 'ALLEN', 'SALESMAN', '7698.0', '1981-02-11', '1600', '300.0', '30']
['6', '7844', 'TURNER', 'SALESMAN', '7698.0', '1981-08-21', '1500', '0.0', '30']
['7', '7900', 'JAMES', 'CLERK', '7698.0', '1981-12-11', '950', '', '30']
['8', '7521', 'WARD', 'SALESMAN', '7698.0', '1981-02-23', '1250', '500.0', '30']
['9', '7902', 'FORD', 'ANALYST', '7566.0', '1981-12-11', '3000', '', '20']
['10', '7369', 'SMITH', 'CLERK', '7902.0', '1980-12-09', '800', '', '20']
['11', '7788', 'SCOTT', 'ANALYST', '7566.0', '1982-12-22', '3000', '', '20']
['12', '7876', 'ADAMS', 'CLERK', '7788.0', '1983-01-15', '1100', '', '20']
['13', '7934', 'MILLER', 'CLERK', '7782.0', '1982-01-11', '1300', '', '10']

문제230. 판다스를 이용하지 말고 이름과 월급*12.3을 출력하시오.

In [96]:
#from google.colab import files
#myfile = files.upload()
import csv
file = open('emp22.csv')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1],int(emp_list[5])*12.3)

KING 61500.0
BLAKE 35055.0
CLARK 30135.0
JONES 36592.5
MARTIN 15375.0
ALLEN 19680.0
TURNER 18450.0
JAMES 11685.0
WARD 15375.0
FORD 36900.0
SMITH 9840.0
SCOTT 36900.0
ADAMS 13530.0
MILLER 15990.000000000002

문제231. 위의 결과를 다시 출력하는데 소수점 첫번째 자리에서 반올림되게

In [99]:
import csv
file = open('emp22.csv')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1],round(int(emp_list[5])*12.3))

KING 61500
BLAKE 35055
CLARK 30135
JONES 36592
MARTIN 15375
ALLEN 19680
TURNER 18450
JAMES 11685
WARD 15375
FORD 36900
SMITH 9840
SCOTT 36900
ADAMS 13530
MILLER 15990

문제232. 직업이 SALESMAN인 사원들의 이름과 직업을 출력하는데 판다스 이용하지 말고 emp2.csv를 읽어서 출력하시오.

In [110]:
file = open('emp22.csv')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    if emp_list[2] == 'SALESMAN':
        print(emp_list[1],emp_list[2])

MARTIN SALESMAN
ALLEN SALESMAN
TURNER SALESMAN
WARD SALESMAN

아 어렵다.  

문제233.(점심시간 문제) 부서번호가 20번인 사원들의 이름과 월급과 부서번호를 출력하시오 ~  
```
판다스를 이용한 방법:

판다스를 이용하지 않은 방법:
```

In [122]:
import pandas as pd
emp2 = pd.read_csv('emp22.csv')
result = emp[['ename','sal','deptno']][emp['deptno']==20]
print(result)

    ename   sal  deptno
3   JONES  2975      20
9    FORD  3000      20
10  SMITH   800      20
11  SCOTT  3000      20
12  ADAMS  1100      20

In [125]:
import csv
file = open('emp22.csv')
emp_csv = csv.reader(file)
for emp_list in emp_csv:
    if emp_list[7] == '20':
        print(emp_list[1],emp_list[5],emp_list[7])

JONES 2975 20
FORD 3000 20
SMITH 800 20
SCOTT 3000 20
ADAMS 1100 20

# 69. 실수형 자료를 정수형 자료로 변환하기(int)  

* 파이썬의 변환함수 정리
```
        데이터 유형      변환함수
정수형      int            int()
문자형      str            str()
실수형      float          float()
리스트형    list           list()
튜플형      tuple          tuple()
```
코드 작성시 수학연상을 하다보면 정수끼리만 계산해야 하는 경우가 있습니다. 이 때 우리가 가진 데이터가 실수형이라면 실수형 자료를 정수형으로 변환한 후에 계산을 해주어야 합니다.  
파이썬 내장함수 int()는 인자로 입력된 실수형 자료를 정수형 자료로 변환해줍니다. int()는 입력된 실수형 자료의 소수부분은 버리고 정수부분만 취하여 정수값으로 리턴합니다.  

예제:

In [126]:
print(int(-5.4))

-5

문제234. 판다스를 이용해서 emp3.csv를 읽어다가 이름과 월급을 출력하는데 월급을 출력할 때 소수점 이하는 버리고 정수부분만 출력되게 하시오!

In [127]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
print(emp[['ename','sal']])

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
9     FORD  3000
10   SMITH   800
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

설명: int()함수를 따로 안써도 정수형으로 출력되고 있습니다. 판다스를 이용하지 않았을 때와는 다르게 숫자는 바로 숫자형으로 출력해주고 있습니다.

# 70. 정수형 자료를 실수형 자료로 변환하기(float)

이미지 처리나 공학용 프로그램을 작성할 때 실수형 끼리만 계산해야하는 경우가 많습니다. 이 때 우리가 가진 데이터가 정수형이라고 하면 정수형 자료를 실수형 자료로 변환한 후에 계산해주어야 합니다. 파이썬 내장함수 float()는 인자로 입력된 정수형 자료를 실수형으로 변환해줍니다.  
예:

In [128]:
print(float(10))

10.0

문제235. 판다스를 이용해서 이름과 월급을 출력하는데 월급을 출력할 때 실수형으로 출력하시오!

In [148]:
#myfile = files.upload()
emp = pd.read_csv('emp3.csv')
result = emp[['ename','sal']]
emp['sal'] = emp['sal'].apply(float) # emp 데이터프레임의 sal 컬럼의 데이터를 float(실수형)으로
                                     # 변환해서 emp 데이터 프레임에 sal 컬럼의 데이터로 변경해라
print(emp[['ename','sal']])

     ename     sal
0     KING  5000.0
1    BLAKE  2850.0
2    CLARK  2450.0
3    JONES  2975.0
4   MARTIN  1250.0
5    ALLEN  1600.0
6   TURNER  1500.0
7    JAMES   950.0
8     WARD  1250.0
9     FORD  3000.0
10   SMITH   800.0
11   SCOTT  3000.0
12   ADAMS  1100.0
13  MILLER  1300.0

설명: emp['sal'].apply 는 emp 데이터 프레임에 sal 시리즈에 apply 함수를 적용해서 데이터 유형을 변경할 수 있습니다.

# 71. 정수 리스트에서 소수만 걸러내기(filter)

파이썬 내장함수인 filter()는 릿트와 같은 자료형에서 특정 조건을 만족하는 값만 편리하게 추출할 수 있는 방법을 제공합니다. filter()의 첫번째 인자는 특정 조건의 값을 추출하는 함수가 입력되며 두번째 인자(입력매개변수) 리스트와 같은 자료형이 입력됩니다.  

예제: 숫자가 나열되어 있는 리스트에서 짝수만 추출해내는 코드를 작성

In [161]:
a = [1,2,3,4,5,6,7,8,9,10]
b =[]
for i in a:
    if i % 2 == 0:
        b.append(i)
print(b)

[2, 4, 6, 8, 10]

for 안 쓸 수 있다.
1. 숫자를 입력하면 짝수이면 결과를 출력하고 홀수면 출력하지 않는 함수를 생성

In [160]:
def get_even(num):
    if num%2 == 0:
        return num
    else:
        return # 리턴다음에 아무것도 쓰지 않아서 아무것도 리턴되지 않음

print(get_even(2))
print(get_even(7))

2
None

2. filter 함수와 get_even 함수를 이용해서 위의 a 리스트에서 짝수를 추출하기

In [168]:
result = filter(get_even,a)
print(list(result))   # list함수로 리스트로 변환해야 제대로 출력이 됩니다.

[2, 4, 6, 8, 10]

문제236. 아래의 리스트에서 숫자가 300 이상이면 출력하고 300 미만이면 출력되지 않게 하시오.

In [170]:
b = [100,352,254,456,123,234,567,903]

def above_300(a):
    if a >= 300:
        return a
    else:
        return

result = filter(above_300,b)
print(list(result))

[352, 456, 567, 903]

이야 잘된다.  

문제237. 우리반 데이터에서 나이가 30살 이상인 나이만 따로 결과로 리스트로 출력하시오.

In [182]:
def above_30(a):
    if a >= 30:
        return a
    else:
        return

result = filter(above_30,emp12['AGE'])
print(list(result))

[31, 35, 33, 30, 36, 44]

# 72. 최대값, 최소값 구하기(max, min)  

max()와 min()은 인자로 입력된 자료에서 최대, 최소값을 구해주는 함수입니다. max()와 min()의 인자로 리스트와 같은 시퀀스 자료가 입력되면 시퀀스 자료의 요소 가운데 최대값 또는 최소값을 구하여 리턴합니다.
```
   오라클        vs         파이썬
    max                      max
    min                      min
    count                    len
    sum                      sum
    avg                      mean
```
예제:

In [183]:
a = [8,7,12,55,21,34,15,9,22]
print(max(a))

55

문제238. 사원 테이블에서 최대월급을 출력하시오! emp3.csv  

1. 판다스를 이용했을 때  

2. 판다스를 이용하지 않았을 때

In [186]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
print(emp['sal'].max())

5000

In [210]:
import csv
file = open('emp22.csv')
emp = csv.reader(file)
a = []
for i in emp:
    a.append(int(i[5]))
print(max(a))

5000

문제239. 우리반 데이터(emp122.csv)에서 최소나이를 출력하시오!  

1. 판다스 이용했을 때  

2. 판다스 이용하지 않았을 때

In [215]:
import pandas as pd
emp12 = pd.read_csv('emp122.csv')
result = emp12['AGE'].min()
result

24

In [244]:
import csv
file = open('emp122.csv')
emp12 = csv.reader(file)
a = []
for i in emp12:
    try:
        a.append(int(i[2]))
    except:
        print('')
print(min(a))

24

# 73. 판다스에서 결측치(NAN) 확인하기  
```
emp3.csv에 comm처럼 결측치(NaN)를 처리하는 판다스 함수를 배웁니다.
                        Not a Number
```

예: 판다스를 이용해서 이름과 커미션을 출력하시오!

In [246]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
result = emp[['ename','comm']]
result

     ename    comm
0     KING     NaN
1    BLAKE     NaN
2    CLARK     NaN
3    JONES     NaN
4   MARTIN  1400.0
5    ALLEN   300.0
6   TURNER     0.0
7    JAMES     NaN
8     WARD   500.0
9     FORD     NaN
10   SMITH     NaN
11   SCOTT     NaN
12   ADAMS     NaN
13  MILLER     NaN

문제240. 커미션이 결측치(NaN)인 사원들의 이름과 커미션을 출력하시오.

In [261]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
result = emp[['ename','comm']][emp['comm'].isnull()] # =='NaN' 이거 아니다 바보야
result

     ename  comm
0     KING   NaN
1    BLAKE   NaN
2    CLARK   NaN
3    JONES   NaN
7    JAMES   NaN
9     FORD   NaN
10   SMITH   NaN
11   SCOTT   NaN
12   ADAMS   NaN
13  MILLER   NaN

문제241. 커미션이 결측치(NaN)이 아닌 사람들의 이름과 커미션을 출력하시오.

In [255]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
result = emp[['ename','comm']][~emp['comm'].isnull()]
result

    ename    comm
4  MARTIN  1400.0
5   ALLEN   300.0
6  TURNER     0.0
8    WARD   500.0

* 데이터 받았으면 데이터 분석을 하기 전에 데이터 전처리를 해야하는데 전처리중에서 결측치 확인하는 단계가 있습니다.  

문제242. emp3.csv에 결측치가 있는지 확인하는 방법?

In [262]:
print(emp.isnull().sum())

index        0
empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

.sum()을 하면 컬럼별로 결측치의 숫자가 나온다. 꼭 기억  

설명: 결측치가 있으면 데이터 분석하기가 어렵고 머신러닝을 이용한 데이터 분석인 경우 좋은(정확도가 높은) 머신러닝 모델이 나오기가 어렵습니다. 결측치를 처리를 해줘야 합니다.  

문제244. 타이타닉 데이터에 결측치가 어느 컬럼에 많은지 확인하시오.

In [266]:
#file = files.upload()
titanic = pd.read_csv('train.csv')
print(titanic.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# 74. 판다스에서 파생변수 추가하는 방법

파생변수란 기존의 데이터를 가지고 새롭게 가공해서 만든 새로운 컬럼입니다.  

예제: 판다스에서 컬럼 추가하는 방법  

emp 데이터 프레임에 sal의 데이터와 똑같은 데이터로 sal2라는 컬럼을 추가하려면?

In [267]:
import pandas as pd

emp = pd.read_csv('emp3.csv')
emp['sal2'] = emp['sal']
print(emp)

    index  empno   ename        job  ...   sal    comm  deptno  sal2
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10  5000
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30  2850
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10  2450
3       4   7566   JONES    MANAGER  ...  2975     NaN      20  2975
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30  1250
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30  1600
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30  1500
7       8   7900   JAMES      CLERK  ...   950     NaN      30   950
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30  1250
9      10   7902    FORD    ANALYST  ...  3000     NaN      20  3000
10     11   7369   SMITH      CLERK  ...   800     NaN      20   800
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20  3000
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20  1100
13     14   7934  MILLER      CLERK  ...  1300     NaN      10  1300

[14 rows x 10 columns]

맨 끝에 sal2라는 컬럼이 생겼다.  

문제245. 판다스를 이용해서 이름과 부서위치를 출력하시오.(emp3.csv와 dept3.csv를 이용하세요)

In [275]:
emp = pd.read_csv('emp3.csv')
dept = pd.read_csv('dept3.csv')
result = pd.merge(emp, dept,how = 'inner', on = 'deptno')
print(result[['ename','loc']])

     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    BLAKE   CHICAGO
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9    JONES    DALLAS
10    FORD    DALLAS
11   SMITH    DALLAS
12   SCOTT    DALLAS
13   ADAMS    DALLAS

문제246. emp 데이터 프레임에 loc 컬럼을 추가하고 해당 사원의 부서위치로 값읋 갱신하시오!

In [278]:
emp = pd.read_csv('emp3.csv')
dept = pd.read_csv('dept3.csv')
emp['loc'] = result['loc']     # emp 데이터프레임에 loc 컬럼 추가하면서
emp                            # result의 loc로 값을 갱신

    index  empno   ename        job  ...   sal    comm  deptno       loc
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10  NEW YORK
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30  NEW YORK
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10  NEW YORK
3       4   7566   JONES    MANAGER  ...  2975     NaN      20   CHICAGO
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30   CHICAGO
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30   CHICAGO
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30   CHICAGO
7       8   7900   JAMES      CLERK  ...   950     NaN      30   CHICAGO
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30   CHICAGO
9      10   7902    FORD    ANALYST  ...  3000     NaN      20    DALLAS
10     11   7369   SMITH      CLERK  ...   800     NaN      20    DALLAS
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20    DALLAS
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20    DALLAS
13     14   7934  MILLER      CLERK  ...  1300     NaN      10    DALLAS

[14 rows x 10 columns]

설명: 파생변수를 왜 추가를 할까?  
emp 테이블에서 퇴사할 것 같은 사원이 누구인지 예측하시오. 머신러닝 이용해서 예측을 하면 됩니다.  
머신러닝이 예측을 잘하려면 좋은 데이터를 주고 학습시켜야 합니다.  
자기의 월급이 자기가 속한 직업의 평균월급보다 더 작은 월급을 받는 사원이면 퇴사할 가능성 높다.  
직업별 평균월급이 emp 데이터 프레임에 추가 되어 있으면 머신러닝이 예측하기 좋은 데이터가 추가가 된 것 입니다.  

문제247. 직업, 직업별 평균월급을 판다스로 출력하시오!

In [296]:
emp = pd.read_csv('emp3.csv')
result = emp.groupby('job')['sal'].mean().reset_index()
result['sal'] = result['sal'].astype(int)
print(result)

         job   sal
0    ANALYST  3000
1      CLERK  1037
2    MANAGER  2758
3  PRESIDENT  5000
4   SALESMAN  1400

오오 된다된다. 한꺼번에는 정수형으로 바꿀 수 없기 때문에 컬럼별로 정수형으로 바꿔준다.  

문제248. emp와 result를 서로 조인해서 조인된 전체 데이터 프레임을 출력하시오.

In [300]:
result2 = pd.merge(emp,result,how = 'inner',on = 'job')
result2

    index  empno   ename        job  ...  sal_x    comm  deptno  sal_y
0       1   7839    KING  PRESIDENT  ...   5000     NaN      10   5000
1       2   7698   BLAKE    MANAGER  ...   2850     NaN      30   2758
2       3   7782   CLARK    MANAGER  ...   2450     NaN      10   2758
3       4   7566   JONES    MANAGER  ...   2975     NaN      20   2758
4       5   7654  MARTIN   SALESMAN  ...   1250  1400.0      30   1400
5       6   7499   ALLEN   SALESMAN  ...   1600   300.0      30   1400
6       7   7844  TURNER   SALESMAN  ...   1500     0.0      30   1400
7       9   7521    WARD   SALESMAN  ...   1250   500.0      30   1400
8       8   7900   JAMES      CLERK  ...    950     NaN      30   1037
9      11   7369   SMITH      CLERK  ...    800     NaN      20   1037
10     13   7876   ADAMS      CLERK  ...   1100     NaN      20   1037
11     14   7934  MILLER      CLERK  ...   1300     NaN      10   1037
12     10   7902    FORD    ANALYST  ...   3000     NaN      20   3000
13     12   7788   SCOTT    ANALYST  ...   3000     NaN      20   3000

[14 rows x 10 columns]

설명: emp에도 sal이 있고 result에도 sal이 있어서 emp의 sal은 컬럼명이 sal_x로 변경되었고 result의 sal은 sal_y로 변경되었습니다.  

문제249. emp 데이터 프레임에 컬럼을 하나 추가하는데 job_avgsal로 추가하고 문제 248번에서 구한 직업별 평균 월급인 result2['sal_y']의 값으로 값을 갱신하시오.

In [303]:
emp['job_avgsal'] = result2['sal_y']
emp

    index  empno   ename        job  ...   sal    comm  deptno  job_avgsal
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10        5000
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30        2758
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10        2758
3       4   7566   JONES    MANAGER  ...  2975     NaN      20        2758
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30        1400
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30        1400
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30        1400
7       8   7900   JAMES      CLERK  ...   950     NaN      30        1400
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30        1037
9      10   7902    FORD    ANALYST  ...  3000     NaN      20        1037
10     11   7369   SMITH      CLERK  ...   800     NaN      20        1037
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20        1037
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20        3000
13     14   7934  MILLER      CLERK  ...  1300     NaN      10        3000

[14 rows x 10 columns]

설명: 현업에서 머신러닝 데이터 분석가들이 하는 일 중 상당수가 바로 이런 파생변수를 추가하는 작업입니다. 좋은 파생변수를 추가해야 머신러닝이 예측을 잘 할 수 있습니다.  
게임회사에서 어떻게 응용하냐면 그 게임을 탈퇴할 것 같은 유저를 머신러닝으로 찾아서 형평성에 어긋나지 않도록 하면서 그 유저가 인식하지 못하도록 조용히 혜택을 줍니다.

문제250. emp 데이터 프레임에 해당 사원이 근무하는 부서번호의 평균월급을 sal_avg라는 이름으로 파생변수를 생성하시오.

In [338]:
emp = pd.read_csv('emp3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index()
result2 = pd.merge(emp,result,how='inner',on='deptno')
emp['sal_avg'] = result2['sal_y']
emp

    index  empno   ename        job  ...   sal    comm  deptno      sal_avg
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10  2916.666667
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30  2916.666667
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10  2916.666667
3       4   7566   JONES    MANAGER  ...  2975     NaN      20  1566.666667
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30  1566.666667
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30  1566.666667
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30  1566.666667
7       8   7900   JAMES      CLERK  ...   950     NaN      30  1566.666667
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30  1566.666667
9      10   7902    FORD    ANALYST  ...  3000     NaN      20  2175.000000
10     11   7369   SMITH      CLERK  ...   800     NaN      20  2175.000000
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20  2175.000000
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20  2175.000000
13     14   7934  MILLER      CLERK  ...  1300     NaN      10  2175.000000

[14 rows x 10 columns]

아 어렵다.  

문제251. 판다스로 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오.

In [339]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
result = emp.sort_values('sal', ascending = False)
print(result)

    index  empno   ename        job  ...         hiredate   sal    comm  deptno
0       1   7839    KING  PRESIDENT  ...  1981-11-17 0:00  5000     NaN      10
9      10   7902    FORD    ANALYST  ...  1981-12-11 0:00  3000     NaN      20
11     12   7788   SCOTT    ANALYST  ...  1982-12-22 0:00  3000     NaN      20
3       4   7566   JONES    MANAGER  ...  1981-04-01 0:00  2975     NaN      20
1       2   7698   BLAKE    MANAGER  ...  1981-05-01 0:00  2850     NaN      30
2       3   7782   CLARK    MANAGER  ...  1981-05-09 0:00  2450     NaN      10
5       6   7499   ALLEN   SALESMAN  ...  1981-02-11 0:00  1600   300.0      30
6       7   7844  TURNER   SALESMAN  ...  1981-08-21 0:00  1500     0.0      30
13     14   7934  MILLER      CLERK  ...  1982-01-11 0:00  1300     NaN      10
4       5   7654  MARTIN   SALESMAN  ...  1981-09-10 0:00  1250  1400.0      30
8       9   7521    WARD   SALESMAN  ...  1981-02-23 0:00  1250   500.0      30
12     13   7876   ADAMS      CLERK  ...  1983-01-15 0:00  1100     NaN      20
7       8   7900   JAMES      CLERK  ...  1981-12-11 0:00   950     NaN      30
10     11   7369   SMITH      CLERK  ...  1980-12-09 0:00   800     NaN      20

[14 rows x 9 columns]

설명: 판다스를 사용할 때 데이터를 정렬하려면 위와 같이 srot_values옵션을 쓰면 된다.  
```
ascending = True : 낮은 값에 높은값 순으로 정렬하겠다.
ascending = False : 높은 값에 낮은값 순으로 정렬하겠다.
```

문제252. (오늘의 마지막 문제) 아래의 SQL을 판다스로 구현하시오!  
```
SQL>
select job, sum(sal)
    from emp
    group by job
    having sum(sal) >= 6000
    order by sum(sal) desc;
```

In [350]:
import pandas as pd
emp = pd.read_csv('emp3.csv')
emp = emp.groupby('job')['sal'].sum().reset_index()
#emp = emp[['job','sal']][emp['sal']>= 6000]
#emp = emp.sort_values('sal',ascending = False)
print(emp)

         job   sal
0    ANALYST  6000
1      CLERK  4150
2    MANAGER  8275
3  PRESIDENT  5000
4   SALESMAN  5600